package my.day06.b.multiFor.gugudan;

public class Gugudan_main1 {

	 /*
	    >> 몇단볼래? => 8엔터
	    
	    === 8단 ===
	    8*1=8
	    8*2=16 
	    8*3=24
	    8*4=32
	    8*5=40
	    8*6=48
	    8*7=56
	    8*8=64
	    8*9=72 
	    
	    >> 또 하시겠습니까?[Y/N] => y엔터 또는 Y엔터
	    
	    >> 몇단볼래? => 1.34엔터 또는 똘똘이엔터
	    >>> 2단부터 9단까지만 가능합니다 <<<
	    
	    >> 몇단볼래? => 345엔터
	    >>> 2단부터 9단까지만 가능합니다 <<<
	    
	    >> 몇단볼래? => 3엔터
	    
	    === 3단 ===
	    3*1=3
	    3*2=6 
	    3*3=9
	    3*4=12
	    3*5=15
	    3*6=18
	    3*7=21
	    3*8=24
	    3*9=27
	       
	    >> 또 하시겠습니까?[Y/N] => s엔터 또는 S엔터
	    >>> Y 또는 N 만 가능합니다!! <<<
	    
	    >> 또 하시겠습니까?[Y/N] => n엔터 또는 N엔터
	    
	    == 프로그램종료 ==   
	 */
	
	public static void main(String[] args) {
		

	}

}
