package my.day10.b.multiDimension;

public class TwoDimensionArray_main {

	public static void main(String[] args) {
		
		// === 1차원 배열 ===
		int[] subjectArr = new int[5]; // 1행 5열
	/*
			 ---------------------
	index => | 0 | 1 | 2 | 3 | 4 |	
			 ---------------------
	*/
		
		
		// === 2차원 배열 ===
		int[][] pointArr = new int[4][3]; // 4행 3열
	/*
	
	index =>
			----------------------------
			| [0][0] | [0][1] | [0][2] |
			----------------------------
			| [1][0] | [1][1] | [1][2] |
			----------------------------
			| [2][0] | [2][1] | [2][2] |
			----------------------------
	
	*/
		
		
	}// end of main(String[] args) ----------------------------------------------

}
